{
  "All": {
    "description": "Ein Informatikstudent mit Fokus auf Entwicklung von modernen, performanten Anwendungen",
    "comingSoon": "Kommt bald"
  },
  "Routes": {
    "about": "Über mich",
    "experience": "Erfahrung",
    "projects": "Projekte",
    "blog": "Blog",
    "contact": "Kontakt"
  },
  "Home": {
    "aboutMe": "Hallo! Ich bin ein {age}-jähriger Student und studiere Informatik mit der Vertiefung Softwaretechnik. Programmieren ist einer meiner Leidenschaften, und in meiner Freizeit arbeite ich gerne an kleinen Projekten, probiere neue Technologien aus und verbessere meine Fähigkeiten. Ich bin immer offen dafür, Neues zu lernen und mich sowohl beruflich als auch persönlich weiterzuentwickeln.",
    "aboutMyOtherHobbies": "Neben dem Programmieren spiele ich gerne Klavier und reise gerne mit Freunden, um neue Orte zu erkunden."
  },
  "Projects": {
    "Status": {
      "archived": "Archiviert",
      "developing": "Alpha/Beta (in Entwicklung)",
      "active": "Stable (aktiv)",
      "completed": "Stable (abgeschlossen)"
    },
    "Visibility": {
      "private": "Privat",
      "public": "Öffentlich"
    },
    "readMore": "Mehr",
    "Descriptions": {
      "comingSoon": "Kommt bald...",
      "keyTrack": "Alles in einem: Dein Trainings-Hub, um Noten und Stücke zu organisieren und tägliches Üben in messbare Erfolge umzuwandeln.",
      "raspberryPi5": "Eine einfache Ansible-Einrichtung zur Automatisierung und Verwaltung des Raspberry Pi 5 als Home-Server, um verschiedene Dienste effizient bereitzustellen und konstant gut zu betreiben.",
      "personalSite": "Englisch-/deutschsprachiges Portfolio, welches mich, meine privaten Projekte und meinen Blog präsentieren.",
      "nix-config": "Eine umfassende, plattformübergreifende Nix-Konfigurations-Repository, die Systemeinstellungen und Benutzerumgebungen über mehrere Betriebssysteme hinweg verwaltet. Diese Repository bietet reproduzierbare, deklarative Konfigurationen für NixOS (einschließlich NixOS über WSL) und macOS.",
      "projectManagerCli": "Ein plattformübergreifendes CLI-Tool, um das Projektmanagement zu optimieren und schnell zwischen verschiedenen Projekten zu wechseln.",
      "nvimSwitcher": "Ein plattformübergreifendes CLI-Tool zum einfachen Wechsel zwischen verschiedenen Neovim-Distributionen.",
      "playersAllianceDashboard": "Ein Dashboard für die 'Players Alliance', eine Gaming-Community für das Spiel 'Clash of Clans'. Ein Verwaltungstool für Moderatoren und Administratoren, um monatliche Events im Spiel zu verwalten. Es kommuniziert mit der CoC-API, um Spielerdaten abzurufen.",
      "ticTacToe": "Eine simple Website für das Spielen von Tic Tac Toe. Im Rahmen der Schule mit einem Freund zusammen erstellt.",
      "frontendMentorChallenges": "Kleine simple Challenges von Frontend Mentor.",
      "youngThievesClo": "Eine Shopping-Website, welche Kleidung verkauft, einschließlich T-Shirts, Hoodies, Jacken, Jeans, Shorts und Accessoires.",
      "niteClash": "Ein Upgrade-Progress-Tracker für das Spiel 'Clash of Clans' zu entwickeln, welcher mit der CoC-API interagiert, um Spielerdaten abzurufen.",
      "gamesWeb": "Eine simple Website zum Spielen von Spielen wie Tic Tac Toe und Vier gewinnt.",
      "mathTools": "Eine simple Website für mathematische Operationen wie PQ-Formel, Satz des Pythagoras und Dreiecksberechnungen.",
      "galaxyAlpha": "Ein vielseitiger Discord-Bot mit Ticket-, Gewinnspiel-, Währungs-, Moderations-, Spiel- und Musiksystem. Verfügt über eine Web-Oberfläche zur einfachen Verwaltung der Bot-Einstellungen."
    }
  },
  "Experience": {
    "current": "Aktuell",
    "Skills": {
      "languages": "Sprachen",
      "libs": "Frameworks & Biblotheken",
      "tools": "Tools",
      "os": "Betriebssysteme"
    },
    "Levels": {
      "basic": "Grundlegend",
      "skilled": "Geübt",
      "experienced": "Erfahren",
      "advanced": "Fortgeschritten",
      "expert": "Experte"
    },
    "JobTitles": {
      "dualStudent": "Dualer Student",
      "schoolInternship": "Schulpraktikant"
    },
    "CompanyDescriptions": {
      "mbjSolutions": "In diesem Unternehmen sammelte ich Erfahrungen in der Fertigung, einschließlich Montage, Schaltschrankbau und Inbetriebnahme. Darüber hinaus war ich am Wareneingang und Lagermanagement beteiligt.",
      "vonBorstel": "In diesem Unternehmen habe ich Einblicke in die Backend-Entwicklung mit PHP bekommen. Mit diesem erworbenen Wissen habe ich eine Blogseite mit Solid.js als Client und PHP als Backend erstellt.",
      "adesso": "In diesem Unternehmen absolviere ich mein duales Studium. Hier sammle ich Erfahrungen in der Softwareentwicklung und lerne verschiedene Technologien und Tools kennen, um moderne, performante Anwendungen zu entwickeln."
    }
  },
  "Blog": {
    "description": "Blogbeiträge und Tutorials zu meinen privaten Projekten. Im Moment ausschließlich auf Englisch.",
    "publishedAt": "Veröffentlicht am",
    "author": "Autor",
    "views": "Aufrufe",
    "exploreMore": "Vollständigen Blog ansehen"
  },
  "Footer": {
    "allRightsReserved": "Alle Rechte vorbehalten"
  },
  "Settings": {
    "language": "Sprache",
    "Theme": {
      "name": "Modus",
      "light": "Hell",
      "dark": "Dunkel"
    }
  },
  "NotFound": {
    "message": "Die angeforderte Seite ist nicht verfügbar.",
    "returnToHome": "Zur Startseite"
  },
  "Error": {
    "Messages": {
      "default": "Oh nein, irgendetwas ist schiefgelaufen... vielleicht neuladen?",
      "nvimCommits": "Commits der Neovim-Distributionen konnten nicht abgerufen werden... vielleicht neuladen?",
      "blogOverview": "Blog konnte nicht abgerufen werden... vielleicht neuladen?"
    },
    "retry": "Erneut versuchen"
  }
}
