{
  "All": {
    "description": "Ein leidenschaftlicher Hobby-Softwareentwickler mit Fokus auf Entwicklung von modernen, performanten Anwendungen.",
    "comingSoon": "Kommt bald"
  },
  "Routes": {
    "about": "Über mich",
    "experience": "Erfahrung",
    "projects": "Projekte",
    "blog": "Blog",
    "contact": "Kontakt"
  },
  "Home": {
    "aboutMe": "Hallo! Ich bin ein {age}-jähriger Gymnasiast aus Deutschland. Derzeit mache ich mein Abitur, welches ich im Juli abschließen werde. In meiner Freizeit programmiere ich gerne Apps und bin immer offen Neues zu lernen. Auch experimentiere ich gerne mit Entwicklertools; Neovim ist seit einiger Zeit mein Haupt-Code-Editor.",
    "aboutMyOtherHobbies": "Neben dem Programmieren spiele ich gerne Klavier und reise gerne mit Freunden, um neue Orte zu erkunden."
  },
  "Projects": {
    "Status": {
      "archived": "Archiviert",
      "developing": "Alpha/Beta (in Entwicklung)",
      "active": "Stable (aktiv)",
      "completed": "Stable (abgeschlossen)"
    },
    "Descriptions": {
      "personalSite": "Englisch-/deutschsprachiges Portfolio, welches mich, mein Fähigkeiten, meine Projekte und meinen Blog präsentieren.",
      "dotfiles": "Eine Sammlung von Konfigurationsdateien, welche für Windows und Linux (Ubuntu, Arch) optimiert sind. Beeinhaltet auch eine Neovim-Konfiguration und eine CLI neben chezmoi.",
      "ticTacToe": "Eine simple Website für das Spielen von Tic Tac Toe. Im Rahmen der Schule.",
      "gamesWeb": "Eine simple Website zum Spielen von Spielen wie Tic Tac Toe und Vier gewinnt.",
      "mathTools": "Eine simple Website für mathematische Operationen wie PQ-Formel, Satz des Pythagoras und Dreiecksberechnungen.",
      "galaxyAlpha": "Ein vielseitiger Discord-Bot mit Ticket-, Gewinnspiel-, Währungs-, Moderations-, Spiel- und Musiksystem. Verfügt über eine Web-Oberfläche zur einfachen Verwaltung der Bot-Einstellungen."
    }
  },
  "Experience": {
    "latest": "Aktuellste",
    "Skills": {
      "languages": "Sprachen",
      "libs": "Frameworks & Biblotheken",
      "tools": "Tools",
      "platforms": "Plattformen",
      "os": "Betriebssysteme"
    },
    "Levels": {
      "basic": "Grundlegend",
      "skilled": "Geübt",
      "experienced": "Erfahren",
      "advanced": "Fortgeschritten",
      "expert": "Experte"
    },
    "JobTitles": {
      "schoolInternship": "Schulpraktikant"
    },
    "CompanyDescriptions": {
      "mbjSolutions": "In diesem Unternehmen sammelte ich Erfahrungen in der Fertigung, einschließlich Montage, Schaltschrankbau und Inbetriebnahme. Darüber hinaus war ich am Wareneingang und Lagermanagement beteiligt.",
      "vonBorstel": "In diesem Unternehmen habe ich Einblicke in die Backend-Entwicklung mit PHP bekommen. Mit diesem erworbenen Wissen habe ich eine Blogseite mit Solid.js als Client und PHP als Backend erstellt."
    }
  },
  "Blog": {
    "description": "Blogbeiträge und Tutorials zu meiner Laufbahn als Entwickler. Im Moment ausschließlich auf Englisch.",
    "publishedAt": "Veröffentlicht am",
    "author": "Autor",
    "views": "Aufrufe",
    "exploreMore": "Vollständigen Blog ansehen"
  },
  "Footer": {
    "allRightsReserved": "Alle Rechte vorbehalten"
  },
  "Settings": {
    "language": "Sprache",
    "Theme": {
      "name": "Modus",
      "light": "Hell",
      "dark": "Dunkel"
    }
  },
  "NotFound": {
    "message": "Die angeforderte Seite ist nicht verfügbar.",
    "returnToHome": "Zur Startseite"
  },
  "Error": {
    "message": "Oh nein, irgendetwas ist schiefgelaufen... vielleicht neuladen?",
    "retry": "Erneut versuchen"
  }
}
