{
  "All": {
    "description": "A CS Student dedicated to learning and specializing in creating modern, performant applications",
    "comingSoon": "Coming soon"
  },
  "Routes": {
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "blog": "Blog",
    "contact": "Contact"
  },
  "Home": {
    "aboutMe": "Hello! I'm a {age}-year-old student, pursuing a degree in Computer Science with a focus on Software Engineering. I'm passionate about programming and enjoy working on small projects in my free time, exploring new technologies, and improving my skills. I'm always eager to learn new things and grow both professionally and personally.",
    "aboutMyOtherHobbies": "In addition to coding, I'm passionate about playing the piano and enjoy traveling and exploring new places with friends."
  },
  "Projects": {
    "Status": {
      "archived": "Archived",
      "developing": "Alpha/Beta (in development)",
      "active": "Stable (active)",
      "completed": "Stable (completed)"
    },
    "Visibility": {
      "private": "Private",
      "public": "Public"
    },
    "readMore": "More",
    "Descriptions": {
      "comingSoon": "Coming soon...",
      "keyTrack": "An all-in-one practice hub for managing repertoire and scores, and turning daily sessions into measurable progress.",
      "raspberryPi5": "A streamlined Ansible setup designed to automate and manage the configuration of a Raspberry Pi 5 as a home server, ensuring efficient deployment and consistent performance for various services.",
      "personalSite": "Bilingual portfolio showcasing me, my hobby projects and my blog.",
      "nix-config": "A comprehensive, cross-platform Nix configuration repository managing system settings and user environments across multiple operating systems. This repository provides reproducible, declarative configurations for NixOS (including NixOS via WSL) and macOS.",
      "projectManagerCli": "A cross-platform CLI tool for optimized project management and quick switching between projects.",
      "nvimSwitcher": "A cross-platform CLI tool for effortless switching between various Neovim distributions.",
      "playersAllianceDashboard": "A dashboard designed for the 'Players Alliance', a gaming community dedicated to 'Clash of Clans'. This management tool enables moderators and administrators to oversee monthly in-game events. It interfaces with the CoC API to retrieve player data.",
      "ticTacToe": "A simple website for playing Tic Tac Toe. Part of a school project created with a friend.",
      "frontendMentorChallenges": "Small and simple challenges from Frontend Mentor.",
      "youngThievesClo": "A shopping website that offers a variety of clothes, including T-shirts, hoodies, jackets, jeans, shorts, and accessories.",
      "niteClash": "An upgrade progress tracker for the game 'Clash of Clans', which interacts with the CoC API to fetch player data.",
      "gamesWeb": "A simple website for playing games such as Tic Tac Toe and Connect Four.",
      "mathTools": "A simple website for mathematical operations such as the PQ formula, Pythagorean theorem, and triangle calculations.",
      "galaxyAlpha": "A multi-purpose all in one Discord bot with ticket, giveaway, currency, moderation, game and music system. Also features a web interface for easy management of bot settings."
    }
  },
  "Experience": {
    "current": "Current",
    "Skills": {
      "languages": "Languages",
      "libs": "Frameworks & Libraries",
      "tools": "Tools",
      "os": "Operating Systems"
    },
    "Levels": {
      "basic": "Basic",
      "skilled": "Skilled",
      "experienced": "Experienced",
      "advanced": "Advanced",
      "expert": "Expert"
    },
    "JobTitles": {
      "dualStudent": "Dual Student",
      "schoolInternship": "School Intern"
    },
    "CompanyDescriptions": {
      "mbjSolutions": "During my time at the company, I gained experience in manufacturing, including assembly, control cabinet construction, and commissioning. Additionally, I was involved in managing incoming goods and warehouse operations.",
      "vonBorstel": "During my time at the company, I learned about backend development using PHP. Using this knowledge, I built a blog page with Solid.js as the client and PHP as the backend.",
      "adesso": "In this company, I am completing my dual studies. Here, I gain experience in software development and learn various technologies and tools to create modern, high-performance applications."
    }
  },
  "Blog": {
    "description": "Blog posts and tutorials on my hobby projects.",
    "publishedAt": "Published at",
    "author": "Author",
    "views": "Views",
    "exploreMore": "See full blog"
  },
  "Footer": {
    "allRightsReserved": "All rights reserved"
  },
  "Settings": {
    "language": "Language",
    "Theme": {
      "name": "Theme",
      "light": "Light",
      "dark": "Dark"
    }
  },
  "NotFound": {
    "message": "The requested page could not be found.",
    "returnToHome": "Return to Home page"
  },
  "Error": {
    "Messages": {
      "default": "Oh no, something went wrong... maybe refresh?",
      "nvimCommits": "Failed to load commits of Neovim distributions... maybe refresh?",
      "blogOverview": "Failed to load blogs... maybe refresh?"
    },
    "retry": "Retry"
  }
}
