{
  "All": {
    "description": "A passionate hobbyist software engineer dedicated to learning and specializing in creating modern, performant applications.",
    "comingSoon": "Coming soon"
  },
  "Routes": {
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "blog": "Blog",
    "contact": "Contact"
  },
  "Home": {
    "aboutMe": "Hello! I'm a {age}-year-old student from Germany currently working towards my Abitur, which I'll be completing this July. In my free time, I'm passionate about building apps and always eager to learn new things. I also enjoy experimenting with development tools, and Neovim has been my go-to editor for quite a while now.",
    "aboutMyOtherHobbies": "In addition to coding, I'm passionate about playing the piano and enjoy traveling and exploring new places with friends."
  },
  "Projects": {
    "Status": {
      "archived": "Archived",
      "developing": "Alpha/Beta (in development)",
      "active": "Stable (active)",
      "completed": "Stable (completed)"
    },
    "Visibility": {
      "private": "Private",
      "public": "Public"
    },
    "readMore": "More",
    "Descriptions": {
      "personalSite": "Bilingual portfolio showcasing me, my skills, my projects and my blog.",
      "dotfiles": "A collection of configuration files for Windows and Linux (Ubuntu, Arch). This also includes a Neovim configuration and a customized CLI built on top of chezmoi.",
      "projectManagerCli": "A cross-platform CLI tool for optimized project management and quick switching between projects.",
      "nvimSwitcher": "A cross-platform CLI tool for effortless switching between various Neovim distributions.",
      "playersAllianceDashboard": "A dashboard designed for the 'Players Alliance', a gaming community dedicated to 'Clash of Clans'. This management tool enables moderators and administrators to oversee monthly in-game events. It interfaces with the CoC API to retrieve player data.",
      "ticTacToe": "A simple website for playing Tic Tac Toe. Part of a school project created with a friend.",
      "frontendMentorChallenges": "Small and simple challenges from Frontend Mentor.",
      "youngThievesClo": "A shopping website that offers a variety of clothes, including T-shirts, hoodies, jackets, jeans, shorts, and accessories.",
      "niteClash": "An upgrade progress tracker for the game 'Clash of Clans', which interacts with the CoC API to fetch player data.",
      "gamesWeb": "A simple website for playing games such as Tic Tac Toe and Connect Four.",
      "mathTools": "A simple website for mathematical operations such as the PQ formula, Pythagorean theorem, and triangle calculations.",
      "galaxyAlpha": "A multi-purpose all in one Discord bot with ticket, giveaway, currency, moderation, game and music system. Also features a web interface for easy management of bot settings."
    }
  },
  "Experience": {
    "latest": "Latest",
    "Skills": {
      "languages": "Languages",
      "libs": "Frameworks & Libraries",
      "tools": "Tools",
      "os": "Operating Systems"
    },
    "Levels": {
      "basic": "Basic",
      "skilled": "Skilled",
      "experienced": "Experienced",
      "advanced": "Advanced",
      "expert": "Expert"
    },
    "JobTitles": {
      "schoolInternship": "School Intern"
    },
    "CompanyDescriptions": {
      "mbjSolutions": "During my time at the company, I gained experience in manufacturing, including assembly, control cabinet construction, and commissioning. Additionally, I was involved in managing incoming goods and warehouse operations.",
      "vonBorstel": "During my time at the company, I learned about backend development using PHP. Using this knowledge, I built a blog page with Solid.js as the client and PHP as the backend."
    }
  },
  "Blog": {
    "description": "Blog posts and tutorials on my learning journey as a developer.",
    "publishedAt": "Published at",
    "author": "Author",
    "views": "Views",
    "exploreMore": "See full blog"
  },
  "Footer": {
    "allRightsReserved": "All rights reserved"
  },
  "Settings": {
    "language": "Language",
    "Theme": {
      "name": "Theme",
      "light": "Light",
      "dark": "Dark"
    }
  },
  "NotFound": {
    "message": "The requested page could not be found.",
    "returnToHome": "Return to Home page"
  },
  "Error": {
    "message": "Oh no, something went wrong... maybe refresh?",
    "retry": "Retry"
  }
}
